In [24]:
import pandas as pd

In [25]:
d = pd.DataFrame({'A':[1,2,34,2,3,3,2],'B':[4,3,2,5,4,5,6]})
d2 = d

In [26]:
d.loc[d.A<3,'B'] = 100

In [27]:
d

    A    B
0   1  100
1   2  100
2  34    2
3   2  100
4   3    4
5   3    5
6   2  100

In [28]:
d2.index = [2,5,3,8,6,5,4]

d2

    A    B
2   1  100
5   2  100
3  34    2
8   2  100
6   3    4
5   3    5
4   2  100

In [29]:
#d2[d2.A<2]['B'] = 100
d2.loc[d2.A<2,'B']

2    100
Name: B, dtype: int64

In [30]:
d2

    A    B
2   1  100
5   2  100
3  34    2
8   2  100
6   3    4
5   3    5
4   2  100

In [32]:
d2.loc[[True,True,False,False,False,False,False]]

   A    B
2  1  100
5  2  100

In [22]:
d2

    A    B
2   1  100
5   2  100
3  34    2
8   2  100
6   3    4
5   3    5
4   2  100